/**
 * Счет
 * AcctNum - номер счета
 */
export const ACCT = {
  'Acct': [
    {
      'AcctNum': '10201810000000010019'
    },
    {
      'AcctNum': '47441810000200000020'
    },
    {
      'AcctNum': '47443810000200000023'
    }
  ]}
;

/** Остаток по счету на дату
 * AcctNum - номер счета,связь с объектом
 * OpDate - дата
 * Balance - остаток
 */
export const ACCT_POS = {
  'AcctPos': [
    {
      'AcctNum': '10201810000000010019',
      'Balance': 290.0,
      'OpDate': '2019-07-12'
    },
    {
      'AcctNum': '47441810000200000020',
      'Balance': -90.0,
      'OpDate': '2019-07-12'
    },
    {
      'AcctNum': '47443810000200000023',
      'Balance': -200.0,
      'OpDate': '2019-07-12'
    },
    {
      'AcctNum': '10201810000000010019',
      'Balance': 970.0,
      'OpDate': '2019-07-15'
    },
    {
      'AcctNum': '47441810000200000020',
      'Balance': -470.0,
      'OpDate': '2019-07-15'
    },
    {
      'AcctNum': '47443810000200000023',
      'Balance': -500.0,
      'OpDate': '2019-07-15'
    },
    {
      'AcctNum': '10201810000000010019',
      'Balance':1000.0,
      'OpDate': '2019-07-16'
    },
    {
      'AcctNum': '47441810000200000020',
      'Balance': -434.0,
      'OpDate': '2019-07-16'
    },
    {
      'AcctNum': '47443810000200000023',
      'Balance': -116.0,
      'OpDate': '2019-07-16'
    }
    ]
  };

/** Проводка
 * OpDate - дата
 * AcctNumDb - счет дебета, связь с объектом счет
 * AcctNumCr - счет кредита, Связь с объектом счет
 * Amount - сумма проводки
 *
 */
export const OP_ENTRY = {};

/** Опердень
 * OpDate - дата
 *
 */
export const OP_DATE = {
  'OpDate': [
    {
      'OpDate': '2019-07-12'
    },
    {
      'OpDate': '2019-07-15'
    },
    {
      'OpDate': '2019-07-16'
    }
  ]
};

